apps/contributions/tests/fixtures/payment-provider-data.json

{
  "application": "fakefakefake",
  "application_fee_percent": null,
  "automatic_tax": {
    "enabled": false
  },
  "billing_cycle_anchor": 1667836290,
  "billing_thresholds": null,
  "cancel_at": null,
  "cancel_at_period_end": false,
  "canceled_at": null,
  "collection_method": "charge_automatically",
  "created": 1667836290,
  "currency": "usd",
  "current_period_end": 1699372290,
  "current_period_start": 1667836290,
  "customer": "cus_fake",
  "days_until_due": null,
  "default_payment_method": "pm_fake",
  "default_source": null,
  "default_tax_rates": [],
  "description": null,
  "discount": null,
  "ended_at": null,
  "id": "sub_fake",
  "items": {
    "data": [
      {
        "billing_thresholds": null,
        "created": 1667836291,
        "id": "si_fake",
        "metadata": {},
        "object": "subscription_item",
        "plan": {
          "active": false,
          "aggregate_usage": null,
          "amount": 51155,
          "amount_decimal": "51155",
          "billing_scheme": "per_unit",
          "created": 1667836290,
          "currency": "usd",
          "id": "price_fake",
          "interval": "year",
          "interval_count": 1,
          "livemode": false,
          "metadata": {},
          "nickname": null,
          "object": "plan",
          "product": "prod_fake",
          "tiers_mode": null,
          "transform_usage": null,
          "trial_period_days": null,
          "usage_type": "licensed"
        },
        "price": {
          "active": false,
          "billing_scheme": "per_unit",
          "created": 1667836290,
          "currency": "usd",
          "custom_unit_amount": null,
          "id": "price_fake",
          "livemode": false,
          "lookup_key": null,
          "metadata": {},
          "nickname": null,
          "object": "price",
          "product": "prod_fake",
          "recurring": {
            "aggregate_usage": null,
            "interval": "year",
            "interval_count": 1,
            "trial_period_days": null,
            "usage_type": "licensed"
          },
          "tax_behavior": "unspecified",
          "tiers_mode": null,
          "transform_quantity": null,
          "type": "recurring",
          "unit_amount": 51155,
          "unit_amount_decimal": "51155"
        },
        "quantity": 1,
        "subscription": "sub_fake",
        "tax_rates": []
      }
    ],
    "has_more": false,
    "object": "list",
    "total_count": 1,
    "url": "/v1/subscription_items?subscription=sub_fake"
  },
  "latest_invoice": "in_fake",
  "livemode": false,
  "metadata": {
    "agreed_to_pay_fees": "True",
    "contributor_id": "29",
    "donor_selected_amount": "500.0",
    "referer": "https://foo.revengine-staging.org/donate/",
    "revenue_program_id": "10",
    "revenue_program_slug": "foo",
    "schema_version": "1.1",
    "source": "rev-engine",
    "swag_opt_out": "False"
  },
  "next_pending_invoice_item_invoice": null,
  "object": "subscription",
  "on_behalf_of": null,
  "pause_collection": null,
  "payment_settings": {
    "payment_method_options": null,
    "payment_method_types": null,
    "save_default_payment_method": "on_subscription"
  },
  "pending_invoice_item_interval": null,
  "pending_setup_intent": null,
  "pending_update": null,
  "plan": {
    "active": false,
    "aggregate_usage": null,
    "amount": 51155,
    "amount_decimal": "51155",
    "billing_scheme": "per_unit",
    "created": 1667836290,
    "currency": "usd",
    "id": "price_fake",
    "interval": "year",
    "interval_count": 1,
    "livemode": false,
    "metadata": {},
    "nickname": null,
    "object": "plan",
    "product": "prod_fake",
    "tiers_mode": null,
    "transform_usage": null,
    "trial_period_days": null,
    "usage_type": "licensed"
  },
  "quantity": 1,
  "schedule": null,
  "start_date": 1667836290,
  "status": "active",
  "test_clock": null,
  "transfer_data": null,
  "trial_end": null,
  "trial_start": null
}
